In [58]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [59]:
data = pd.read_csv("obesity_child_age.csv")

In [60]:
data

    index         Time      Age Gender  PercentObese   SE
0       0  [1971,1974]    [2,5]    All           5.0 -0.6
1       1  [1976,1980]    [2,5]    All           5.0 -0.6
2       2  [1988,1994]    [2,5]    All           7.2 -0.7
3       3  [1999,2000]    [2,5]    All          10.3 -1.7
4       4  [2001,2002]    [2,5]    All          10.6 -1.8
..    ...          ...      ...    ...           ...  ...
94     94  [2005,2006]  [12,19]      F          17.3 -2.1
95     95  [2007,2008]  [12,19]      F          16.8 -2.0
96     96  [2009,2010]  [12,19]      F          17.1 -1.3
97     97  [2011,2012]  [12,19]      F          20.7 -2.0
98     98  [2013,2014]  [12,19]      F          21.4 -3.2

[99 rows x 6 columns]

In [61]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   index         99 non-null     int64
 1   Time          99 non-null     object
 2   Age           99 non-null     object
 3   Gender        99 non-null     object
 4   PercentObese  99 non-null     float64
 5   SE            99 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 4.8+ KB

In [62]:
from sklearn.model_selection import train_test_split

X=data.drop(['PercentObese','SE','index'],axis=1)
Y=data['PercentObese']

In [63]:
X_train, X_test, Y_train, Y_test = train_test_split(X,Y, test_size=0.2)
train_data = X_train.join(Y_train)
train_data

           Time      Age Gender  PercentObese
40  [2007,2008]    [2,5]      M           9.3
5   [2003,2004]    [2,5]    All          13.9
72  [2005,2006]    [2,5]      F          11.0
6   [2005,2006]    [2,5]    All          10.7
55  [1971,1974]  [12,19]      M           6.1
..          ...      ...    ...           ...
33  [1971,1974]    [2,5]      M           5.0
84  [2007,2008]   [6,11]      F          18.0
67  [1976,1980]    [2,5]      F           5.3
38  [2003,2004]    [2,5]      M          15.1
46  [1988,1994]   [6,11]      M          11.6

[79 rows x 4 columns]

In [64]:
X_train

           Time      Age Gender
40  [2007,2008]    [2,5]      M
5   [2003,2004]    [2,5]    All
72  [2005,2006]    [2,5]      F
6   [2005,2006]    [2,5]    All
55  [1971,1974]  [12,19]      M
..          ...      ...    ...
33  [1971,1974]    [2,5]      M
84  [2007,2008]   [6,11]      F
67  [1976,1980]    [2,5]      F
38  [2003,2004]    [2,5]      M
46  [1988,1994]   [6,11]      M

[79 rows x 3 columns]